/**
 *   ЭКСПОРТ ЖУРНАЛА ОДНОГО КЛАССА В ФАЙЛ
 *   Copyright © 2020, А.М.Гольдин. Modified BSD License
 */
"use strict";

// В запросе приходят ["8Б", "ivanov"]
//      8Б - это запрашиваемый класс
//  ivanov - это логин автора запроса (подписывается скриптом index.js)
// 
// Возвращается сериализованный в строку объект вида
// {
//   "className": "8А",
//   "list": ["Иванов В.", "Петров П.", ...],
//   "content": [
//      {
//         "s": "Русский язык",
//         "p": "Кулебякин Иван Петрович",
//         "l": [
//            {"d":"03.09","w":2,"t":"Африка","h":"№ 234", "g":["3 4н", ...]},
//            ...
//          ]
//      },
//      ...    
//   ]
// }
module.exports = async (args) => {
   let resp = {};
   try {
      if (args.length != 2) return "none";
      let clName = args[0].substr(0,  3).trim(),
          lg     = args[1].substr(0, 20).trim();

      if (!clName || !lg) return "none";
      
      // Проверяем полномочия автора запроса на запрашиваемый класс
      if (lg != "admin") {      
         let res = await dbFind("staff", {Ulogin: lg});
         if (!res.length) return "none";
      }
      
      // Временная заглушка для отладки фронтенда
      resp = {
         "className": "8А",
         "list": ["Иванов В.", "Петров П.", "Сидоров С."],
         "content": [
            {
               "s": "Русский язык",
               "p": "Кулебякин Иван Петрович",
               "l": [
                  {
                     "d": "03.09",
                     "w": 2,
                     "t": "Правописание жи- ши-",
                     "h": "Упражнение № 234",
                     "g": ["3 4н", "", "нн"]
                  },
                  {
                     "d": "05.09",
                     "w": 1,
                     "t": "Безударные гласные в корне",
                     "h": "Упражнение № 111",
                     "g": ["2", "3 4", ""]
                  }
               ]
            },
            {
               "s": "Математика (алгебра и начала математического анализа)",
               "p": "Сидорова Виолетта Константиновна",
               "l": [
                  {
                     "d": "02.09",
                     "w": 1,
                     "t": "Многочлены и одночлены",
                     "h": "№ 111–222, повторить определение многочлена",
                     "g": ["2 2", "5", "4нн"]
                  },            
                  {
                     "d": "12.10",
                     "w": 0,
                     "t": "Правила сокращения алгебраических дробей",
                     "h": "Закончить домашнюю работу в тетради",
                     "g": ["н", "5 5 5", "2 2 2"]
                  }
               ]
            }     
         ]
      };
      
      return JSON.stringify(resp);
   }
   catch(e) {return "none";}
};
